app/controllers/products_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = NULL LIMIT 1
---
  def show
    authenticate_rem
    follower = @current_user || User.find_by_id(params[:user_id])
    render json: Product.find(params[:id]).simple_info(follower), status: :ok

INSERT INTO `products` (`created_at`, `updated_at`, `name`, `description`, `price`, `shop_id`, `user_id`) VALUES ('2018-08-15 16:44:03', '2018-08-15 16:44:03', 'Honey', 'SweetHoney', 210.54, 6, 1)
---
  def create
    return unless product_params
    render json: Product.create_product(
      @product_params,
      category_list,
      @current_user.id
    ).simple_info, status: :created

INSERT INTO `product_images` (`product_id`, `created_at`, `updated_at`, `picture_file_name`, `picture_content_type`, `picture_file_size`, `picture_updated_at`) VALUES (22, '2018-08-15 17:54:50', '2018-08-15 17:54:50', 'our-autumn-shop-front.jpg', 'image/jpeg', 42234, '2018-08-15 17:54:50')
---
  def add_image
    obtain_product_image_params
    pi = ProductImage.new(picture: @image_params)
    @product.product_images << pi

UPDATE `products` SET `name` = 'Honey 233', `updated_at` = '2018-08-15 18:20:03' WHERE `products`.`id` = 22
---
  def update
    return unless product_params
    render json: @product.simple_info, status: :ok if @product.update!(@product_params)

DELETE FROM `products` WHERE `products`.`id` = 22
---
  def destroy
    p @product.destroy!