app/controllers/roles_controller.rb

  def set_role
    @current_user.role_id = params[:role_id]
    @current_user.save!
---
UPDATE `users` SET `role_id` = '0', `updated_at` = '2018-06-24 20:25:18' WHERE `users`.`id` = 1