app/controllers/shops_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`shop_id` = 6
---
  def show_products
    render json: @shop.products.map(&:simple_info), status: :ok

SELECT `shops`.* FROM `shops` WHERE `shops`.`user_id` = '1'
---
  def my_shops
    render json: @current_user.shops.map(&:simple_info), status: :ok

INSERT INTO `shops` (`name`, `description`, `latitude`, `longitude`, `policy`, `created_at`, `updated_at`, `shop_picture_file_name`, `shop_picture_content_type`, `shop_picture_file_size`, `shop_picture_updated_at`) VALUES ('TestShop', 'This is a test shop', 107.333, 48.9929, 'This is a test shop policy', '2018-07-23 17:57:02', '2018-07-23 17:57:02', 'our-autumn-shop-front.jpg', 'image/jpeg', 42234, '2018-07-23 17:57:01')
---
  def create
    @shop = Shop.create!(
      name: params[:title],
      description: params[:description],
      latitude: params[:latitude],
      longitude: params[:longitude],
      place_id: params[:place_id],
      shop_picture: params[:shop_picture],
      shop_logo: params[:shop_logo],
      policy: params[:policy]
    )

SELECT  `shops`.* FROM `shops` WHERE `shops`.`id` = 6 LIMIT 1
---
  def set_shop
    @shop = Shop.find(params[:id])