app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'hectortest@outlook.com' LIMIT 1
INSERT INTO `users` (`first_name`, `last_name`, `birthday`, `sex`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('Hector', 'Acosta', '1997-06-03', 'Male', 'hector.acosta@test.com', '$2a$10$BIIELQ6Py4JdbWwg/6yNSOCtsvX395NSmrmDKm7UWg/t3FVYa1gBG', '2018-05-11 01:07:06', '2018-05-11 01:07:06')
---
  def create
    if User.find_by_email params[:email]
      render json: {error: 'User exist'}, status: :bad_request
    else
      user = User.create!(
        email: params[:email],
        password: params[:password],
        password_confirmation: params[:password_confirmation],
        first_name: params[:first_name],
        last_name: params[:last_name],
        sex: params[:sex],
        birthday: params[:birthday]
      )

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def show
    authenticate_rem
    render json: @current_user.try(:simple_info) ||
                 User.find_by_id(params[:user_id]).try(:simple_info) ||
                 User.all.map(&:simple_info),
           status: :ok